IOsonata/IOsonata/ARM/Nordic/nRF52/src/usbd_ctrlr_nrf52.c
/**-------------------------------------------------------------------------
@file	usbd_ctrlr_nrf52.c

@brief	IOsonata USB device controller for Nordic nRF52 USBD.

Implements usbd_ctrlr.h directly on the nRF52840 USBD peripheral. It owns
endpoint state, EasyDMA arbitration and USBD_IRQHandler. USB power, VBUS and
clock sequencing remain in usbd_nrfx.cpp.

Only control, bulk and interrupt endpoints are implemented here. Isochronous
support is intentionally left out of the first USB milestone.

The nRF52840 has one USBD EasyDMA engine shared by all endpoints. Pending DMA
work is kept as endpoint bit masks. Control tasks are serviced first, then OUT
endpoints, then IN endpoints so a ready OUT endpoint is rearmed promptly.

Errata 199 is applied around every EasyDMA task.

@author	Hoang Nguyen Hoan
@date	Aug. 29, 2026

@license

MIT License

Copyright (c) 2026, I-SYST inc., all rights reserved

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

----------------------------------------------------------------------------*/
#include <stdatomic.h>
#include <string.h>

#include "nrf.h"
#include "nrf_peripherals.h"
#include "nrf_erratas.h"

#include "usb/usbd_ctrlr.h"

#ifndef USBD_PRESENT
#error "usbd_ctrlr_nrf52: this part has no USBD peripheral"
#endif

enum
{
	NRFX_USBD_EP_COUNT = 8,
	NRFX_USBD_MAX_PACKET_SIZE = 64,
	NRFX_USBD_DMA_EP_NONE = 0xFFU,
};

#define NRFX_USBD_IRQ_EVENT_COUNT	(USBD_INTEN_EPDATA_Pos + 1)

#define NRFX_USBD_ERRATA_199_REG \
	(*((volatile uint32_t *)0x40027C1CUL))

typedef struct __nRF_Usbd_Xfer
{
	uint8_t *pBuffer;
	uint16_t TotalLen;
	volatile uint16_t ActualLen;
	uint16_t Mps;
	volatile bool DataReceived;
	volatile bool Started;
} nRFUsbdXfer_t;

typedef struct __nRF_Usbd_Ctrlr
{
	nRFUsbdXfer_t Xfer[NRFX_USBD_EP_COUNT][2];
	UsbdCtrlrEvtHandler_t EvtHandler;
	void *pContext;
	bool SofEnabled;
	bool SetupDirIn;
} nRFUsbdCtrlr_t;

static nRFUsbdCtrlr_t s_Ctrlr;
static atomic_flag s_DmaRunning = ATOMIC_FLAG_INIT;
static atomic_uint_fast8_t s_DmaEpAddr;
static atomic_uint_fast16_t s_PendingOut;
static atomic_uint_fast16_t s_PendingIn;
static atomic_bool s_PendingEp0Status;
static atomic_bool s_PendingEp0RcvOut;
static atomic_bool s_BusSuspended;
static atomic_bool s_SuspendPending;
static atomic_bool s_RemoteWakePending;
static atomic_bool s_HostResumePending;
static atomic_bool s_MacAwake;

static inline uint8_t nRFUsbdDir(uint8_t EpAddr)
{
	return USBD_EP_IS_IN(EpAddr) ? 1U : 0U;
}

static inline nRFUsbdXfer_t *nRFUsbdGetXfer(uint8_t EpAddr)
{
	return &s_Ctrlr.Xfer[USBD_EP_NUM(EpAddr)][nRFUsbdDir(EpAddr)];
}

static uint8_t nRFUsbdFirstPending(uint16_t Mask)
{
	for (uint8_t EpNum = 0; EpNum < NRFX_USBD_EP_COUNT; EpNum++)
	{
		if ((Mask & (1U << EpNum)) != 0U)
		{
			return EpNum;
		}
	}

	return NRFX_USBD_EP_COUNT;
}

static uint32_t nRFUsbdDmaEndMask(uint8_t EpAddr)
{
	const uint8_t epNum = USBD_EP_NUM(EpAddr);

	return USBD_EP_IS_IN(EpAddr) ?
		(1UL << (USBD_INTEN_ENDEPIN0_Pos + epNum)) :
		(1UL << (USBD_INTEN_ENDEPOUT0_Pos + epNum));
}

static volatile uint32_t *nRFUsbdDmaEndEvent(uint8_t EpAddr)
{
	const uint8_t epNum = USBD_EP_NUM(EpAddr);

	return USBD_EP_IS_IN(EpAddr) ?
		&NRF_USBD->EVENTS_ENDEPIN[epNum] :
		&NRF_USBD->EVENTS_ENDEPOUT[epNum];
}

static void nRFUsbdEmit(const UsbdCtrlrEvt_t *pEvt)
{
	if (s_Ctrlr.EvtHandler != NULL)
	{
		s_Ctrlr.EvtHandler(pEvt, s_Ctrlr.pContext);
	}
}

static void nRFUsbdEmitSimple(UsbdCtrlrEvtType_t Type)
{
	UsbdCtrlrEvt_t evt = { .Type = Type };
	nRFUsbdEmit(&evt);
}

static void nRFUsbdEmitXfer(uint8_t EpAddr, uint16_t Length,
						 UsbdCtrlrXferResult_t Result)
{
	UsbdCtrlrEvt_t evt = {
		.Type = USBD_CTRLR_EVT_XFER_CMPL,
		.Xfer = {
			.EpAddr = EpAddr,
			.Length = Length,
			.Result = Result,
		},
	};
	nRFUsbdEmit(&evt);
}

static void nRFUsbdDmaRelease(void)
{
	if (nrf52_errata_199())
	{
		NRFX_USBD_ERRATA_199_REG = 0x00000000UL;
	}

	atomic_store(&s_DmaEpAddr, NRFX_USBD_DMA_EP_NONE);
	atomic_flag_clear(&s_DmaRunning);
}

static void nRFUsbdDmaStart(volatile uint32_t *pTask, uint8_t EpAddr)
{
	if (nrf52_errata_199())
	{
		NRFX_USBD_ERRATA_199_REG = 0x00000082UL;
	}

	atomic_store(&s_DmaEpAddr, EpAddr);
	*pTask = 1;
	__ISB();
	__DSB();
}

static void nRFUsbdDmaWait(void)
{
	for (;;)
	{
		const uint8_t epAddr = (uint8_t)atomic_load(&s_DmaEpAddr);
		if (epAddr == NRFX_USBD_DMA_EP_NONE)
		{
			return;
		}

		// A USB reset cancels endpoint activity in hardware. Leave the reset
		// event for the IRQ handler, but do not wait forever for an ENDEP event
		// that the reset may have suppressed.
		if (NRF_USBD->EVENTS_USBRESET != 0U)
		{
			nRFUsbdDmaRelease();
			return;
		}

		volatile uint32_t *pEvent = nRFUsbdDmaEndEvent(epAddr);
		if (*pEvent == 0U)
		{
			continue;
		}

		*pEvent = 0;
		__ISB();
		__DSB();
		nRFUsbdDmaRelease();
	}
}

static void nRFUsbdNoDmaTask(volatile uint32_t *pTask)
{
	*pTask = 1;
	__ISB();
	__DSB();

	atomic_flag_clear(&s_DmaRunning);
}

static void nRFUsbdEp0StatusNow(void)
{
	const uint8_t epAddr = s_Ctrlr.SetupDirIn ?
		USBD_EP_DIR_OUT : USBD_EP_DIR_IN;
	nRFUsbdXfer_t *pXfer = nRFUsbdGetXfer(epAddr);

	// EP0STATUS permits the hardware status stage. nRF52 has no separate
	// status-complete event, so publish the synthetic completion only when the
	// task is actually issued, never while it is still queued behind EasyDMA.
	NRF_USBD->TASKS_EP0STATUS = 1;
	__ISB();
	__DSB();

	// Keep s_DmaRunning held across the callback. A completion callback may
	// queue more endpoint work; the outer service loop will pick it up after
	// this status operation has been fully published.
	if (pXfer->Started && pXfer->TotalLen == 0U)
	{
		pXfer->Started = false;
		nRFUsbdEmitXfer(epAddr, 0, USBD_CTRLR_XFER_SUCCESS);
	}

	atomic_flag_clear(&s_DmaRunning);
}

static bool nRFUsbdStartOutDmaNow(uint8_t EpNum)
{
	nRFUsbdXfer_t *pXfer = &s_Ctrlr.Xfer[EpNum][0];

	if (!pXfer->Started || pXfer->ActualLen > pXfer->TotalLen)
	{
		return false;
	}

	const uint16_t Remaining =
		(uint16_t)(pXfer->TotalLen - pXfer->ActualLen);
	const uint16_t Received = (uint16_t)NRF_USBD->SIZE.EPOUT[EpNum];
	const uint16_t TransferLen =
		Received < Remaining ? Received : Remaining;

