IOsonata/IOsonata/ARM/Nordic/nRF52/src/usbd_ctrlr_nrf52.c
static void nRFUsbdTryRemoteWake(void)
{
	if (!atomic_load(&s_RemoteWakePending) ||
		!atomic_load(&s_BusSuspended) ||
		atomic_load(&s_HostResumePending) ||
		!atomic_load(&s_MacAwake) ||
		NRF_USBD->LOWPOWER !=
			(USBD_LOWPOWER_LOWPOWER_ForceNormal <<
			 USBD_LOWPOWER_LOWPOWER_Pos))
	{
		return;
	}

	// Serialize DPDMDRIVE with the same lock that owns EasyDMA scheduling.
	// This closes the small race where application context requests wake while
	// the IRQ has selected a pending DMA but has not written STARTEP yet.
	if (atomic_flag_test_and_set(&s_DmaRunning))
	{
		return;
	}

	if (!atomic_load(&s_RemoteWakePending) ||
		!atomic_load(&s_BusSuspended) ||
		atomic_load(&s_HostResumePending) ||
		!atomic_load(&s_MacAwake) ||
		(uint8_t)atomic_load(&s_DmaEpAddr) != NRFX_USBD_DMA_EP_NONE)
	{
		atomic_flag_clear(&s_DmaRunning);
		return;
	}

	atomic_store(&s_RemoteWakePending, false);
	NRF_USBD->DPDMVALUE = USBD_DPDMVALUE_STATE_Resume;
	NRF_USBD->TASKS_DPDMDRIVE = 1;
	__ISB();
	__DSB();
	atomic_flag_clear(&s_DmaRunning);

	// SOF is also the recovery path for hosts that resume by simply restarting
	// frames instead of generating the RESUME event (nRF52 anomaly 211).
	if ((NRF_USBD->INTEN & USBD_INTEN_SOF_Msk) == 0U)
	{
		NRF_USBD->EVENTS_SOF = 0;
	}
	NRF_USBD->INTENSET = USBD_INTENSET_SOF_Msk;
}

static void nRFUsbdHostResumeDetected(void)
{
	if (!atomic_load(&s_BusSuspended))
	{
		return;
	}

	// Host activity wins over a pending device-initiated remote wake.
	atomic_store(&s_BusSuspended, false);
	atomic_store(&s_SuspendPending, false);
	atomic_store(&s_RemoteWakePending, false);

	if (!atomic_load(&s_MacAwake) ||
		NRF_USBD->LOWPOWER !=
			(USBD_LOWPOWER_LOWPOWER_ForceNormal <<
			 USBD_LOWPOWER_LOWPOWER_Pos))
	{
		atomic_store(&s_HostResumePending, true);
		if (NRF_USBD->LOWPOWER !=
			(USBD_LOWPOWER_LOWPOWER_ForceNormal <<
			 USBD_LOWPOWER_LOWPOWER_Pos))
		{
			NRF_USBD->LOWPOWER =
				USBD_LOWPOWER_LOWPOWER_ForceNormal <<
				USBD_LOWPOWER_LOWPOWER_Pos;
			__ISB();
			__DSB();
		}
		return;
	}

	atomic_store(&s_HostResumePending, false);
	nRFUsbdEmitSimple(USBD_CTRLR_EVT_RESUME);
}

static void nRFUsbdWakeAllowed(void)
{
	atomic_store(&s_MacAwake, true);

	if (atomic_exchange(&s_HostResumePending, false))
	{
		nRFUsbdEmitSimple(USBD_CTRLR_EVT_RESUME);
		return;
	}

	// USBWUALLOWED is generated for every ForceNormal transition. Only a
	// remote-wake request is allowed to drive K-state on the bus.
	nRFUsbdTryRemoteWake();
}

bool UsbdCtrlrInit(UsbdCtrlrEvtHandler_t EvtHandler, void *pContext)
{
	s_Ctrlr.EvtHandler = EvtHandler;
	s_Ctrlr.pContext = pContext;
	nRFUsbdResetState();

	return true;
}

void UsbdCtrlrStop(void)
{
	nRFUsbdDmaWait();
	nRFUsbdResetState();
}

void UsbdCtrlrIntEnable(void)
{
	NVIC_EnableIRQ(USBD_IRQn);
}

void UsbdCtrlrIntDisable(void)
{
	NVIC_DisableIRQ(USBD_IRQn);
}

void UsbdCtrlrConnect(void)
{
	NRF_USBD->USBPULLUP = 1;
}

void UsbdCtrlrDisconnect(void)
{
	NRF_USBD->USBPULLUP = 0;
}

void UsbdCtrlrRemoteWakeup(void)
{
	if (!atomic_load(&s_BusSuspended) ||
		atomic_load(&s_HostResumePending))
	{
		return;
	}

	// Stop draining queued endpoint work. Remote wake takes priority as soon
	// as any EasyDMA operation already in progress has completed.
	atomic_store(&s_SuspendPending, false);
	atomic_store(&s_RemoteWakePending, true);

	if (NRF_USBD->LOWPOWER !=
		(USBD_LOWPOWER_LOWPOWER_ForceNormal <<
		 USBD_LOWPOWER_LOWPOWER_Pos))
	{
		NRF_USBD->LOWPOWER =
			USBD_LOWPOWER_LOWPOWER_ForceNormal <<
			USBD_LOWPOWER_LOWPOWER_Pos;
		__ISB();
		__DSB();
	}

	nRFUsbdTryRemoteWake();
}

void UsbdCtrlrSofEnable(bool Enable)
{
	s_Ctrlr.SofEnabled = Enable;

	if (Enable)
	{
		NRF_USBD->EVENTS_SOF = 0;
		NRF_USBD->INTENSET = USBD_INTENSET_SOF_Msk;
	}
	else
	{
		NRF_USBD->INTENCLR = USBD_INTENCLR_SOF_Msk;
	}
}

void UsbdCtrlrSetAddress(uint8_t Address)
{
	// nRF52840 USBADDR is read-only. SET_ADDRESS is completed by hardware.
	(void)Address;
}

bool UsbdCtrlrEpOpen(const UsbEndPointDesc_t *pDesc)
{
	if (pDesc == NULL)
	{
		return false;
	}

	const uint8_t epAddr = pDesc->bEndpointAddress;
	const uint8_t epNum = USBD_EP_NUM(epAddr);
	const uint8_t type = pDesc->bmAttributes & 0x03U;

	if (epNum == 0 || epNum >= NRFX_USBD_EP_COUNT ||
		(type != USB_ENDPATT_TRANS_BULK &&
		 type != USB_ENDPATT_TRANS_INT) ||
		pDesc->wMaxPacketSize == 0 ||
		pDesc->wMaxPacketSize > NRFX_USBD_MAX_PACKET_SIZE)
	{
		return false;
	}

	nRFUsbdXfer_t *pXfer = nRFUsbdGetXfer(epAddr);
	pXfer->Mps = pDesc->wMaxPacketSize;
	pXfer->Started = false;
	pXfer->DataReceived = false;

	if (USBD_EP_IS_IN(epAddr))
	{
		NRF_USBD->EVENTS_ENDEPIN[epNum] = 0;
		NRF_USBD->INTENSET =
			(1UL << (USBD_INTEN_ENDEPIN0_Pos + epNum));
		NRF_USBD->EPINEN |= (1UL << epNum);
	}
	else
	{
		NRF_USBD->EVENTS_ENDEPOUT[epNum] = 0;
		NRF_USBD->INTENSET =
			(1UL << (USBD_INTEN_ENDEPOUT0_Pos + epNum));
		NRF_USBD->EPOUTEN |= (1UL << epNum);
		NRF_USBD->SIZE.EPOUT[epNum] = 0;
	}

	NRF_USBD->EPSTALL =
		(USBD_EPSTALL_STALL_UnStall << USBD_EPSTALL_STALL_Pos) | epAddr;
	NRF_USBD->DTOGGLE =
		(USBD_DTOGGLE_VALUE_Data0 << USBD_DTOGGLE_VALUE_Pos) | epAddr;
	__ISB();
	__DSB();

	return true;
}

void UsbdCtrlrEpClose(uint8_t EpAddr)
{
	const uint8_t epNum = USBD_EP_NUM(EpAddr);

	if (epNum == 0 || epNum >= NRFX_USBD_EP_COUNT)
	{
		return;
	}

	if ((uint8_t)atomic_load(&s_DmaEpAddr) == EpAddr)
	{
		nRFUsbdDmaWait();
	}

	const uint_fast16_t bit = (uint_fast16_t)(1U << epNum);
	nRFUsbdXfer_t *pXfer = nRFUsbdGetXfer(EpAddr);

	if (USBD_EP_IS_IN(EpAddr))
	{
		atomic_fetch_and(&s_PendingIn, ~bit);
		NRF_USBD->INTENCLR =
			(1UL << (USBD_INTEN_ENDEPIN0_Pos + epNum));
		NRF_USBD->EPINEN &= ~(1UL << epNum);
		NRF_USBD->EVENTS_ENDEPIN[epNum] = 0;
		NRF_USBD->EPDATASTATUS = (1UL << epNum);
	}
	else
	{
		atomic_fetch_and(&s_PendingOut, ~bit);
		NRF_USBD->INTENCLR =
			(1UL << (USBD_INTEN_ENDEPOUT0_Pos + epNum));
		NRF_USBD->EPOUTEN &= ~(1UL << epNum);
		NRF_USBD->EVENTS_ENDEPOUT[epNum] = 0;
		NRF_USBD->EPDATASTATUS = (1UL << (16U + epNum));
		NRF_USBD->SIZE.EPOUT[epNum] = 0;
	}

	pXfer->Started = false;
	pXfer->DataReceived = false;
	pXfer->ActualLen = 0;
	pXfer->TotalLen = 0;
	pXfer->pBuffer = NULL;
	pXfer->Mps = 0;

	__ISB();
	__DSB();
}

