IOsonata/IOsonata/ARM/Nordic/nRF52/src/usbd_ctrlr_nrf52.c
	uint32_t dataStatus = 0;
	if ((intStatus &
		 (USBD_INTEN_EPDATA_Msk | USBD_INTEN_EP0DATADONE_Msk)) != 0)
	{
		dataStatus = NRF_USBD->EPDATASTATUS;
		NRF_USBD->EPDATASTATUS = dataStatus;
		__ISB();
		__DSB();

		for (uint8_t epNum = 1; epNum < NRFX_USBD_EP_COUNT; epNum++)
		{
			if ((dataStatus & (1UL << (16U + epNum))) != 0)
			{
				nRFUsbdHandleOutData(epNum);
			}
		}

		for (uint8_t epNum = 1; epNum < NRFX_USBD_EP_COUNT; epNum++)
		{
			if ((dataStatus & (1UL << epNum)) != 0)
			{
				nRFUsbdHandleInData(epNum);
			}
		}
	}

	const bool setupPending =
		(intStatus & USBD_INTEN_EP0SETUP_Msk) != 0;
	if (setupPending)
	{
		// Any SETUP token is host bus activity and therefore also a resume
		// indication if the host did not provide a separate RESUME event.
		nRFUsbdHostResumeDetected();

		// A SETUP token aborts any previous control transfer. If its local
		// EasyDMA copy is still active, wait only for EP0; unrelated data
		// endpoint DMA remains owned and queued control work waits behind it.
		nRFUsbdAbortEp0();
		nRFUsbdSetupEvent();
	}
	else
	{
		if ((intStatus & USBD_INTEN_ENDEPOUT0_Msk) != 0)
		{
			nRFUsbdHandleOutEnd(0);
		}

		if ((intStatus & USBD_INTEN_EP0DATADONE_Msk) != 0)
		{
			if (s_Ctrlr.SetupDirIn)
			{
				nRFUsbdHandleInData(0);
			}
			else
			{
				nRFUsbdHandleOutData(0);
			}
		}
	}

	if ((intStatus & USBD_INTEN_SOF_Msk) != 0)
	{
		// SOF can be the first observable host activity after suspend.
		nRFUsbdHostResumeDetected();

		UsbdCtrlrEvt_t evt = {
			.Type = USBD_CTRLR_EVT_SOF,
			.FrameNo = (uint16_t)NRF_USBD->FRAMECNTR,
		};
		nRFUsbdEmit(&evt);

		if (!s_Ctrlr.SofEnabled)
		{
			NRF_USBD->INTENCLR = USBD_INTENCLR_SOF_Msk;
		}
	}

	// A pending remote-wake request makes the service gate stop queued work.
	// Running the wake check after service also catches a request that raced
	// the scheduler lock while this IRQ was completing.
	nRFUsbdServicePending();
	nRFUsbdTryRemoteWake();
	nRFUsbdTryEnterLowPower();
}

void USBD_IRQHandler(void)
{
	nRFUsbdIrqHandler();
}
